app/controllers/api_controller.rb

SELECT  "stops".* FROM "stops" WHERE "stops"."StopNo" = $1 LIMIT 1  [["StopNo", 54912]]
---
    def stopCoord()
        if (params[:stop] == nil)
            respond_with("404")
            return
        end

        stop = Stop.find_by("StopNo" => params[:stop].to_i)

SELECT  "stops".* FROM "stops" WHERE "stops"."StopNo" = $1 LIMIT 1  [["StopNo", 50774]]
---
    def getCoor
        if (params[:stop] == nil)
            respond_with("404")
            return
        end

        stop = Stop.find_by(StopNo: params[:stop])

SELECT "stops".* FROM "stops" WHERE "stops"."StopNo" IN (61571, 61570, 54930, 54898, 61568, 54899, 54931, 54929, 54963, 61569, 55025)
---
        puts Time.now - start


        stopdbs = Stop.where(StopNo: stopNumbers)

SELECT  "stops".* FROM "stops" WHERE "stops"."StopNo" = $1 LIMIT 1  [["StopNo", 55061]]
---
    def stop
        @stop = Stop.find_by(StopNo: params[:StonNo])