app/controllers/users_controller.rb

  def index
    if !admin?
        redirect_to root_path
    end
    @users = User.all
---
SELECT "users".* FROM "users"